src/Documents/Scan_ЗакреплениеМенеджеровЗаДилерами/Scan_ЗакреплениеМенеджеровЗаДилерами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Scan_ЗакреплениеМенеджеровЗаДилерами</name>
  <comment>Документ необходим для учета ответственных менеджеров за дилерами, определенных распоряжением по компании</comment>
  <registerRecords>InformationRegister.Scan_ЗакреплениеМенеджеровЗаДилерами</registerRecords>
  <attributes>
    <name>ДатаРаспоряжения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерРаспоряжения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписантВПФ</name>
    <type>
      <types>CatalogRef.Scan_Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтветственныеМенеджеры</name>
    <attributes>
      <name>Дилер</name>
      <type>
        <types>CatalogRef.Scan_Компании</types>
      </type>
    </attributes>
    <attributes>
      <name>Менеджер</name>
      <type>
        <types>CatalogRef.Scan_Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/Scan_ЗакреплениеМенеджеровЗаДилерами/Scan_ЗакреплениеМенеджеровЗаДилерами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ЗакреплениеМенеджеровЗаДилерами</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Scan_Сотрудники</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Дилер</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Scan_Сотрудники/Scan_Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_Сотрудники</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаПриема</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Scan_Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерСканияРусь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФлагУволен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Scan_Компании/Scan_Компании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_Компании</name>
  <predefined>
    <items>
      <name>СканияРусь</name>
      <description>Скания Русь</description>
    </items>
  </predefined>
  <attributes>
    <name>DealerID_COW</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДилера</name>
    <type>
      <types>EnumRef.Scan_ВидыДилеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыКомпаний</name>
    <type>
      <types>CatalogRef.Scan_ГруппыКомпаний</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Дилер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДилерАктивен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДилера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодДилераSOWA</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеАнглийское</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетныйСклад</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
      <types>CatalogRef.Scan_Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыКомпаний</name>
    <type>
      <types>CatalogRef.Scan_СтатусыКомпаний</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипыДилеров</name>
    <type>
      <types>CatalogRef.Scan_ТипыДилеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормыКомпаний</name>
    <type>
      <types>CatalogRef.Scan_ФормыКомпаний</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РегионыОтветственности</name>
    <attributes>
      <name>Регион</name>
      <type>
        <types>CatalogRef.Scan_Регионы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеМаркиДилера</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Марка</name>
      <type>
        <types>CatalogRef.Scan_МаркиПродуктов</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Documents/Scan_ЗакреплениеМенеджеровЗаДилерами/ManagerModule.bsl
// Определяет закрепленного за дилером менеджера.
//
// Параметры:
//  Дилер - СправочникСсылка.Scan_Компании - компания дилера, для которого определяется закрепленный менеджер.
//
// Возвращаемое значение:
//   СправочникСсылка.Scan_Сотрудники - Пустая ссылка если за компанией не закреплен менеджер, 
//	в остальных случаях ссылка на закрепленного менеджера
//  
&НаСервере
Функция ПолучитьЗакрепленногоМенеджера(Дилер) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_ЗакреплениеМенеджеровЗаДилерамиСрезПоследних.Менеджер КАК Менеджер
		|ИЗ
		|	РегистрСведений.Scan_ЗакреплениеМенеджеровЗаДилерами.СрезПоследних(, Дилер = &Ссылка) КАК Scan_ЗакреплениеМенеджеровЗаДилерамиСрезПоследних";
	
	Запрос.УстановитьПараметр("Ссылка", Дилер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ЗакрепленныйМенеджер = Справочники.Scan_Сотрудники.ПустаяСсылка();
	Если ВыборкаДетальныеЗаписи.Следующий() ТОгда
		ЗакрепленныйМенеджер = ВыборкаДетальныеЗаписи.Менеджер;
	КонецЕсли;
	
	Возврат ЗакрепленныйМенеджер;
КонецФункции

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт //rarus bonmak 07.01.2021 16625 ++
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_КураторыПоРегиональнымМенеджерам";
	КомандаПечати.Представление = НСтр("ru = 'Кураторы по региональным менеджерам'");
	КомандаПечати.ПроверкаПроведенияПередПечатью    = Ложь;
	КомандаПечати.ТребуетсяРасширениеРаботыСФайлами = Истина;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_КураторыПоФедеральнымОкругам";
	КомандаПечати.Представление = НСтр("ru = 'Кураторы по федеральным округам'");
	КомандаПечати.ПроверкаПроведенияПередПечатью    = Ложь;
	КомандаПечати.ТребуетсяРасширениеРаботыСФайлами = Истина;
	
КонецПроцедуры //rarus bonmak 07.01.2021 16625 --

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт //rarus bonmak 07.01.2021 16625 ++
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_КураторыПоРегиональнымМенеджерам") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
		"ПФ_MXL_КураторыПоРегиональнымМенеджерам",
		"Кураторы по региональным менеджерам",
		ПечатьПФ_MXL_КураторыПоРегиональнымМенеджерам(МассивОбъектов[0], ОбъектыПечати,, ПараметрыПечати));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_КураторыПоФедеральнымОкругам") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
		"ПФ_MXL_КураторыПоФедеральнымОкругам",
		"Кураторы по федеральным округам",
		ПечатьПФ_MXL_КураторыПоФедеральнымОкругам(МассивОбъектов[0], ОбъектыПечати,, ПараметрыПечати));
	КонецЕсли;
	
КонецПроцедуры //rarus bonmak 07.01.2021 16625 --

Функция ПолучитьДанныеПечати(Знач МассивДокументов, Знач МассивИменМакетов) Экспорт //rarus bonmak 07.01.2021 16625 ++
	
КонецФункции //rarus bonmak 07.01.2021 16625 --

////////////////////////////////////////////////////////////////////////////////
// Интерфейс для вызова из дополнительной печатной формы.

Функция ПечатьПФ_MXL_КураторыПоРегиональнымМенеджерам(ДокументСсылка, ОбъектыПечати, ИмяМакета = "ПФ_MXL_КураторыПоРегиональнымМенеджерам", ПараметрыПечати) Экспорт //rarus bonmak 07.01.2021 16625 ++
	
	Scan_СборСтатистики.Scan_Печать(ИмяМакета); // Rarus tenkam 11.04.2022 mantis 18433 +
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабличныйДокумент.КлючПараметровПечати = ИмяМакета;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Scan_ЗакреплениеМенеджеровЗаДилерами.ПФ_MXL_КураторыПоРегиональнымМенеджерам");
	
	//Заголовок
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ОбластьЗаголовок");
	ОбластьЗаголовок.Параметры.НомерРаспоряжения = ДокументСсылка.НомерРаспоряжения;
	ОбластьЗаголовок.Параметры.ДатаДокумента = Формат(ДокументСсылка.ДатаРаспоряжения, "ДЛФ=DD");
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	//Шапка таблицы
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.Дилер КАК Дилер,
	|	Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.Менеджер КАК Менеджер,
	|	Scan_КомпанииРегионыОтветственности.Регион КАК Регион,
	|	Scan_КомпанииРегионыОтветственности.Регион.ФедеральныйОкруг КАК ФедеральныйОкруг,
	|	Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.Дилер.Наименование КАК ДилерНаименование
	|ИЗ
	|	Документ.Scan_ЗакреплениеМенеджеровЗаДилерами.ОтветственныеМенеджеры КАК Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Scan_Компании.РегионыОтветственности КАК Scan_КомпанииРегионыОтветственности
	|		ПО Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.Дилер = Scan_КомпанииРегионыОтветственности.Ссылка
	|ГДЕ
	|	Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.Ссылка = &СсылкаДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	//rarus bonmak 29.03.2021 17306 ++
	//|	Менеджер,
	//|	ФедеральныйОкруг,
	//|	Регион,
	//|	ДилерНаименование
	|  Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.Менеджер.Наименование,
	|  Scan_КомпанииРегионыОтветственности.Регион.ФедеральныйОкруг.Наименование,
	|  Scan_КомпанииРегионыОтветственности.Регион.Наименование,
	|  Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.Дилер.Наименование
	//rarus bonmak 29.03.2021 17306 --
	|ИТОГИ ПО
	|	Менеджер";
	
	Запрос.Параметры.Вставить("СсылкаДокумент", ДокументСсылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаМенеджер = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Менеджер");
	ОбъединениеНачало = 8;
	ОбъединениеКонец = 8;
	НомерСтраницы = 1;
	Пока ВыборкаМенеджер.Следующий() Цикл
		ОбластьСтрокаМенеджер = Макет.ПолучитьОбласть("СтрокаМенеджер");
		ОбластьСтрокаМенеджер.Параметры.ЗначениеМенеджер = ВыборкаМенеджер.Менеджер;
		НомерСтраницы = Scan_Печать.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьСтрокаМенеджер, , , НомерСтраницы, , ДокументСсылка);
		
		ВыборкаДетЗаписи = ВыборкаМенеджер.Выбрать();
		Пока ВыборкаДетЗаписи.Следующий() Цикл
			
			ОбластьСтрокаРегионы = Макет.ПолучитьОбласть("СтрокаРегионы");
			ОбластьСтрокаРегионы.Параметры.ЗначениеФО = ВыборкаДетЗаписи.ФедеральныйОкруг;
			ОбластьСтрокаРегионы.Параметры.ЗначениеРегион = ВыборкаДетЗаписи.Регион;
			ОбластьСтрокаРегионы.Параметры.ЗначениеДилер = ВыборкаДетЗаписи.Дилер;
			НомерСтраницы = Scan_Печать.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьСтрокаРегионы, , , НомерСтраницы, , ДокументСсылка);
			ОбъединениеКонец = ОбъединениеКонец + 1;
		КонецЦикла;
		//объединим одинаковые ячейки
		ОбъединениеНачалоФО = ОбъединениеНачало;
		ОбъединениеНачалоРегион = ОбъединениеНачало;
		ОбъединениеНачалоДилер = ОбъединениеНачало;
		Для Строка = ОбъединениеНачало По ОбъединениеКонец Цикл
			//объединение ФО
			Если ТабличныйДокумент.Область("R"+Строка+"C2").Текст = ТабличныйДокумент.Область("R"+Строка(Строка-1)+"C2").Текст
				ИЛИ ОбъединениеНачалоФО = Строка Тогда ;
			Иначе
				ТабличныйДокумент.Область("R"+ОбъединениеНачалоФО+"C2"+":"+"R"+Строка(Строка-1)+"C2").Объединить();
				ОбъединениеНачалоФО = Строка;
			КонецЕсли;
			//объединение Регион
			Если ТабличныйДокумент.Область("R"+Строка+"C3").Текст = ТабличныйДокумент.Область("R"+Строка(Строка-1)+"C3").Текст
				ИЛИ ОбъединениеНачалоРегион = Строка Тогда ;
			Иначе
				ТабличныйДокумент.Область("R"+ОбъединениеНачалоРегион+"C3"+":"+"R"+Строка(Строка-1)+"C3").Объединить();
				ОбъединениеНачалоРегион = Строка;
			КонецЕсли;
			//объединение Дилер
			Если ТабличныйДокумент.Область("R"+Строка+"C4").Текст = ТабличныйДокумент.Область("R"+Строка(Строка-1)+"C4").Текст
				ИЛИ ОбъединениеНачалоДилер = Строка Тогда ;
			Иначе
				ТабличныйДокумент.Область("R"+ОбъединениеНачалоДилер+"C4"+":"+"R"+Строка(Строка-1)+"C4").Объединить();
				ОбъединениеНачалоДилер = Строка;
			КонецЕсли;
			
		КонецЦикла;
		ОбъединениеНачало = ОбъединениеКонец + 1; 
		ОбъединениеКонец  = ОбъединениеКонец + 1;
	КонецЦикла;
	
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
	ОбластьПодвал.Параметры.ПодписантДолжность = ДокументСсылка.ПодписантВПФ.Должность;
	ОбластьПодвал.Параметры.Подписант = ДокументСсылка.ПодписантВПФ;
	НомерСтраницы = Scan_Печать.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьПодвал, , , НомерСтраницы, , ДокументСсылка);
	
	Возврат ТабличныйДокумент;
	
КонецФункции //rarus bonmak 07.01.2021 16625 --

Функция ПечатьПФ_MXL_КураторыПоФедеральнымОкругам(ДокументСсылка, ОбъектыПечати, ИмяМакета = "ПФ_MXL_КураторыПоФедеральнымОкругам", ПараметрыПечати) Экспорт //rarus bonmak 07.01.2021 16625 ++
	
	Scan_СборСтатистики.Scan_Печать(ИмяМакета); // Rarus tenkam 11.04.2022 mantis 18433 +
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабличныйДокумент.КлючПараметровПечати = ИмяМакета;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Scan_ЗакреплениеМенеджеровЗаДилерами.ПФ_MXL_КураторыПоФедеральнымОкругам");
	
	//Заголовок
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ОбластьЗаголовок");
	ОбластьЗаголовок.Параметры.НомерРаспоряжения = ДокументСсылка.НомерРаспоряжения;
	ОбластьЗаголовок.Параметры.ДатаДокумента = Формат(ДокументСсылка.ДатаРаспоряжения, "ДЛФ=DD");
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	//Шапка таблицы
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.Дилер КАК Дилер,
	|	Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.Менеджер КАК Менеджер,
	|	Scan_КомпанииРегионыОтветственности.Регион КАК Регион,
	|	Scan_КомпанииРегионыОтветственности.Регион.ФедеральныйОкруг КАК ФедеральныйОкруг,
	|	Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.Дилер.Наименование КАК ДилерНаименование
	|ИЗ
	|	Документ.Scan_ЗакреплениеМенеджеровЗаДилерами.ОтветственныеМенеджеры КАК Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Scan_Компании.РегионыОтветственности КАК Scan_КомпанииРегионыОтветственности
	|		ПО Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.Дилер = Scan_КомпанииРегионыОтветственности.Ссылка
	|ГДЕ
	|	Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.Ссылка = &СсылкаДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	//rarus bonmak 29.03.2021 17306 ++
	//|	ФедеральныйОкруг,
	//|	Регион,
	//|	ДилерНаименование,
	//|	Менеджер
	//|	Менеджер,
	//|	Регион,
	//|	ДилерНаименование
	|  Scan_КомпанииРегионыОтветственности.Регион.ФедеральныйОкруг.Наименование,
	|  Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.Менеджер.Наименование,
	|  Scan_КомпанииРегионыОтветственности.Регион.Наименование,
	|  Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.Дилер.Наименование
	//rarus bonmak 29.03.2021 17306 --
	|ИТОГИ ПО
	|	ФедеральныйОкруг";
	
	Запрос.Параметры.Вставить("СсылкаДокумент", ДокументСсылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаФО = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ФедеральныйОкруг");
	ОбъединениеНачало = 8;
	ОбъединениеКонец = 8;
	НомерСтраницы = 1;
	Пока ВыборкаФО.Следующий() Цикл
		ОбластьСтрокаФО = Макет.ПолучитьОбласть("СтрокаФО");
		ОбластьСтрокаФО.Параметры.ЗначениеФО = ВыборкаФО.ФедеральныйОкруг;
		НомерСтраницы = Scan_Печать.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьСтрокаФО, , , НомерСтраницы, , ДокументСсылка);
		
		ВыборкаДетЗаписи = ВыборкаФО.Выбрать();
		Пока ВыборкаДетЗаписи.Следующий() Цикл
			
			ОбластьСтрокаРегионы = Макет.ПолучитьОбласть("СтрокаРегионы");
			ОбластьСтрокаРегионы.Параметры.ЗначениеМенеджер = ВыборкаДетЗаписи.Менеджер;
			ОбластьСтрокаРегионы.Параметры.ЗначениеРегион = ВыборкаДетЗаписи.Регион;
			ОбластьСтрокаРегионы.Параметры.ЗначениеДилер = ВыборкаДетЗаписи.Дилер;
			НомерСтраницы = Scan_Печать.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьСтрокаРегионы, , , НомерСтраницы, , ДокументСсылка);
			ОбъединениеКонец = ОбъединениеКонец + 1;
		КонецЦикла;
		//объединим одинаковые ячейки
		ОбъединениеНачалоМенеджер = ОбъединениеНачало;
		ОбъединениеНачалоРегион   = ОбъединениеНачало;
		ОбъединениеНачалоДилер    = ОбъединениеНачало;
		Для Строка = ОбъединениеНачало По ОбъединениеКонец Цикл
			//объединение Регион
			Если ТабличныйДокумент.Область("R"+Строка+"C2").Текст = ТабличныйДокумент.Область("R"+Строка(Строка-1)+"C2").Текст
				ИЛИ ОбъединениеНачалоРегион = Строка Тогда ;
			Иначе
				ТабличныйДокумент.Область("R"+ОбъединениеНачалоРегион+"C2"+":"+"R"+Строка(Строка-1)+"C2").Объединить();
				ОбъединениеНачалоРегион = Строка;
			КонецЕсли;
			//объединение Дилер
			Если ТабличныйДокумент.Область("R"+Строка+"C3").Текст = ТабличныйДокумент.Область("R"+Строка(Строка-1)+"C3").Текст
				ИЛИ ОбъединениеНачалоДилер = Строка Тогда ;
			Иначе
				ТабличныйДокумент.Область("R"+ОбъединениеНачалоДилер+"C3"+":"+"R"+Строка(Строка-1)+"C3").Объединить();
				ОбъединениеНачалоДилер = Строка;
			КонецЕсли;
			//объединение Менеджер
			Если ТабличныйДокумент.Область("R"+Строка+"C4").Текст = ТабличныйДокумент.Область("R"+Строка(Строка-1)+"C4").Текст
				ИЛИ ОбъединениеНачалоМенеджер = Строка Тогда ;
			Иначе
				ТабличныйДокумент.Область("R"+ОбъединениеНачалоМенеджер+"C4"+":"+"R"+Строка(Строка-1)+"C4").Объединить();
				ОбъединениеНачалоМенеджер = Строка;
			КонецЕсли;
			
		КонецЦикла;
		ОбъединениеНачало = ОбъединениеКонец + 1; 
		ОбъединениеКонец  = ОбъединениеКонец + 1;
	КонецЦикла;
	
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
	ОбластьПодвал.Параметры.ПодписантДолжность = ДокументСсылка.ПодписантВПФ.Должность;
	ОбластьПодвал.Параметры.Подписант = ДокументСсылка.ПодписантВПФ;
	НомерСтраницы = Scan_Печать.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьПодвал, , , НомерСтраницы, , ДокументСсылка);
	
	Возврат ТабличныйДокумент;
	
КонецФункции //rarus bonmak 07.01.2021 16625 --

#КонецОбласти
#КонецЕсли
